libretiny-eu/libretiny/boards/generic-bk7231t-qfn32-tuya/variant.h
/* This file was auto-generated from generic-bk7231t-qfn32-tuya.json using boardgen */

#pragma once

#include <WVariant.h>

// clang-format off

// Pins
// ----
#define PINS_COUNT         19
#define NUM_DIGITAL_PINS   19
#define NUM_ANALOG_INPUTS  1
#define NUM_ANALOG_OUTPUTS 0

// Analog pins
// -----------
#define PIN_A0 15u    // GPIO23
#define A0     PIN_A0

// SPI Interfaces
// --------------
#define SPI_INTERFACES_COUNT 0

// Wire Interfaces
// ---------------
#define WIRE_INTERFACES_COUNT 2
#define PIN_WIRE1_SCL         12u // GPIO20
#define PIN_WIRE1_SDA         13u // GPIO21
#define PIN_WIRE2_SCL         0u  // GPIO0
#define PIN_WIRE2_SDA         1u  // GPIO1

// Serial ports
// ------------
#define SERIAL_INTERFACES_COUNT 2
#define PIN_SERIAL1_RX          6u // GPIO10
#define PIN_SERIAL1_TX          7u // GPIO11
#define PIN_SERIAL2_RX          1u // GPIO1
#define PIN_SERIAL2_TX          0u // GPIO0
